# 제 1유형_데이터 다루기

## ✅ 데이터 다루기 유형
1. 데이터 타입(object, int, float, bool 등)
2. 기초 통계량 (평균, 중앙값, 사분위수, IQR, 표준편차 등)
3. 데이터 인덱싱, 필터링, 정렬, 변경 등
4. 결측치, 이상치, 중복값 처리(제거 or 대체)
5. 데이터 Scaling(데이터 표준화(z), 데이터 정규화(min-max))
6. 데이터 합치기
7. 날짜/시간 데이터, index 다루기

#### 데이터 불러오기

In [126]:
import numpy as np
import pandas as pd

In [127]:
df = pd.read_csv("/Users/jinyeonglee/BigData_Certification/Data/mtcars.csv")
df.head()

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

### ✅ 1. 데이터 타입 (object, int, float 등)

In [128]:
# 데이터 타입 확인
df.dtypes

car      object
mpg     float64
cyl       int64
disp    float64
hp        int64
drat    float64
wt      float64
qsec    float64
vs        int64
am        int64
gear      int64
carb      int64
dtype: object

In [129]:
# 데이터 타입 변경 (1개)
df1 = df.copy()
df1 = df1.astype({'cyl' : 'object'})
print(df1.dtypes)

car      object
mpg     float64
cyl      object
disp    float64
hp        int64
drat    float64
wt      float64
qsec    float64
vs        int64
am        int64
gear      int64
carb      int64
dtype: object

In [130]:
# 데이터 타입 변경 (2개 이상)
df1 = df1.astype({'cyl' : 'int', 'gear' : 'int'})
print(df1.dtypes)

car      object
mpg     float64
cyl       int64
disp    float64
hp        int64
drat    float64
wt      float64
qsec    float64
vs        int64
am        int64
gear      int64
carb      int64
dtype: object

In [131]:
# 컬럼의 고유 값들 확인
df1['cyl'].value_counts()

cyl
8    14
4    11
6     7
Name: count, dtype: int64

### ✅ 2. 기초 통계량 (평균, 중앙값, IQR, 표준편차 등)

#### 1) 중심측도를 나타내는 값 (평균, 중앙값, 최빈값)

In [132]:
df = pd.read_csv("/Users/jinyeonglee/BigData_Certification/Data/mtcars.csv")
df.head()

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [133]:
df.shape    # return : (행, 열)

(32, 12)

In [134]:
# 평균값
mpg_mean = df['mpg'].mean()
print(mpg_mean)

20.090625000000003

In [135]:
# 중앙값
mpg_median = df['mpg'].median()
print(df['mpg'].median())

19.2

In [136]:
# 최빈값
cyl_mode = df['cyl'].mode()
print("cyl 컬럼 최빈값 : ", cyl_mode[0])
print('-'*30)

# 빈도수 확인
print("cyl 컬럼 데이터별 빈도수 : ", df['cyl'].value_counts())

cyl 컬럼 최빈값 :  8
------------------------------
cyl 컬럼 데이터별 빈도수 :  cyl
8    14
4    11
6     7
Name: count, dtype: int64

#### 2. 산포도를 나타내는 값 (분산, 표준편차, IQR, 범위(최대-최소) 등)

In [137]:
# 분산
mpg_var = df['mpg'].var()
print(mpg_var)

36.32410282258064

In [138]:
# 표준편차
mpg_std = df['mpg'].std()
print(mpg_std)

6.026948052089104

In [139]:
# IQR : Q3 - Q1
mpg_Q1 = df['mpg'].quantile(0.25)
mpg_Q3 = df['mpg'].quantile(0.75)
mpg_IQR = mpg_Q3 - mpg_Q1
print("mpg Q1 : ", mpg_Q1)
print("mpg Q3 : ", mpg_Q3)
print("mpg IQR :" , mpg_IQR)

mpg Q1 :  15.425
mpg Q3 :  22.8
mpg IQR : 7.375

In [140]:
# 2 사분위수 (Q2) == median
print(df['mpg'].quantile(.5) == df['mpg'].median())

True

In [141]:
# 범위(range) = 최대값 - 최소값
mpg_max = df['mpg'].max()
mpg_min = df['mpg'].min()
mpg_range = mpg_max - mpg_min
print("mpg Max : ", mpg_max)
print("mpg Min : ", mpg_min)
print("mpg Range : ", mpg_range)

mpg Max :  33.9
mpg Min :  10.4
mpg Range :  23.5

#### (3) 분포의 비대칭도 (왜도, 첨도)

In [142]:
# 왜도 (좌우 비대칭 정도)
mpg_skew = df['mpg'].skew()
print(mpg_skew)

0.6723771376290805

In [143]:
# 첨도 (상하 뾰족함 정도)
mpg_kurt = df['mpg'].kurt()
print(mpg_kurt)

-0.0220062914240855

#### (4) 기타 (합계, 절대값, 데이터 수)

In [144]:
# 합계
mpg_sum = df['mpg'].sum()
print(mpg_sum)

642.9000000000001

In [145]:
# 절대값
print("- mpg IQR : ", mpg_Q1 - mpg_Q3)
print("abs of mpg IQR : ", abs(mpg_Q1 - mpg_Q3))

- mpg IQR :  -7.375
abs of mpg IQR :  7.375

In [146]:
# 데이터의 수
len(df['mpg'])

32

#### (5) 그룹화하여 계산하기 (groupby 활용)

In [147]:
# Iris 데이터셋을 이용하여 종별 평균값 구해보기
import seaborn as sns
df = sns.load_dataset('iris')
print(df.head())
df.groupby('species').mean()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [148]:
# Iris 종별 중앙값
df.groupby('species').median()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

### ✅ 3. 데이터 인덱싱, 필터링, 정렬, 변경 등

In [149]:
df = pd.read_csv("/Users/jinyeonglee/BigData_Certification/Data/mtcars.csv")
df.head()

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

#### (1) 데이터 인덱싱

In [150]:
# 행 or 열 인덱싱 : df.loc['행', '열]
df.loc[3, 'mpg']

21.4

In [151]:
# 열만 인덱싱
df.loc[:, 'mpg'].head()

0    21.0
1    21.0
2    22.8
3    21.4
4    18.7
Name: mpg, dtype: float64

In [152]:
# mpg, cyl, disp 컬럼의 0 ~ 3번 인덱스 출력
df.loc[:3, ['mpg', 'cyl', 'disp']]

    mpg  cyl   disp
0  21.0    6  160.0
1  21.0    6  160.0
2  22.8    4  108.0
3  21.4    6  258.0

In [153]:
# 앞에서 n행 인덱싱 : df.head(n)
df.head(3)

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1

In [154]:
# 뒤에서 n행 인덱싱 : df.tail(n)
df.tail(7)

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.9,1,1,4,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.7,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.9,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.5,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.5,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.6,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.6,1,1,4,2

#### (2) 열 (Columns) 추가 / 제거

In [155]:
# 단일 열 선택
df_cyl = df['cyl']
print(df_cyl.head(3))
print(df['cyl'].head(3))
print(df.cyl.head(3))

0    6
1    6
2    4
Name: cyl, dtype: int64
0    6
1    6
2    4
Name: cyl, dtype: int64
0    6
1    6
2    4
Name: cyl, dtype: int64

In [156]:
# 여러 행 선택
df_new = df[['cyl', 'mpg']]
df_new.head()

   cyl   mpg
0    6  21.0
1    6  21.0
2    4  22.8
3    6  21.4
4    8  18.7

In [157]:
# 열 제거 전
df.head()

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [158]:
# 열 제거
df.drop(columns=['car', 'mpg', 'cyl']).head()

    disp   hp  drat     wt   qsec  vs  am  gear  carb
0  160.0  110  3.90  2.620  16.46   0   1     4     4
1  160.0  110  3.90  2.875  17.02   0   1     4     4
2  108.0   93  3.85  2.320  18.61   1   1     4     1
3  258.0  110  3.08  3.215  19.44   1   0     3     1
4  360.0  175  3.15  3.440  17.02   0   0     3     2

In [159]:
# 열 추가
df2 = df.copy()
df2['new'] = df['mpg'] + 10
df2.head()

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,new
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,31.0
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,31.0
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1,32.8
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1,31.4
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2,28.7

#### (3) 데이터 필터링

In [161]:
# 1개 조건 : cyl = 4인 데이터의 수
cond1 = df['cyl'] == 4
len(df[cond1])

11

In [163]:
# mpg가 22 이상인 데이터의 수
len(df[df['mpg'] >= 22])

9

In [167]:
# 2개 이상 조건 필터링 (and)
cond2 = df['mpg'] >= 22
df[cond1 & cond2]

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2

In [170]:
# 2개 이상 조건 필터링 (or)
df[cond1 | cond2]

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2

#### (4) 데이터 정렬

In [171]:
# 내림차순
df.sort_values('mpg', ascending=False).head()

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1

In [172]:
# 오름차순
df.sort_values('mpg', ascending=True).head()

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
15,Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
16,Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4

#### (5) 데이터 변경 (조건문)

In [175]:
import numpy as np
df = pd.read_csv("/Users/jinyeonglee/BigData_Certification/Data/mtcars.csv")

# np.where 활용
# hp 컬럼 데이터 중 205가 넘는 값은 205로 처리하고 나머지는 그대로 유지
df['hp'] = np.where(df['hp'] > 205, 205, df['hp'])

# 내림차순 정렬
df.sort_values('hp', ascending=False).head()

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
16,Chrysler Imperial,14.7,8,440.0,205,3.23,5.345,17.42,0,0,3,4
30,Maserati Bora,15.0,8,301.0,205,3.54,3.570,14.60,0,1,5,8
28,Ford Pantera L,15.8,8,351.0,205,4.22,3.170,14.50,0,1,5,4
6,Duster 360,14.3,8,360.0,205,3.21,3.570,15.84,0,0,3,4
23,Camaro Z28,13.3,8,350.0,205,3.73,3.840,15.41,0,0,3,4

### ✅ 4. 결측치, 이상치, 중복값 처리(제거 or 대체)

##### 데이터 불러오기 (타이타닉 데이터셋)
- 종속변수 (y) : 생존 여부 (0 사망, 1 생존)
- 독립변수 (x) : pclass, sex, age 등 탑승자 정보(변수)

In [176]:
import seaborn as sns
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### ✅ 5. 데이터 Scaling(데이터 표준화(z), 데이터 정규화 (min-max))

In [ ]:
# 영상 있음

### ✅ 6. 데이터 합치기

### ✅ 7. 날짜 / 시간 데이터, index 다루기